Repository: Dreamfire73/passhport
Catalog: docs/po/*/LC_MESSAGES/installation-and-configuration/renew-certificate.po
Languages: fr

source: Renew passhportd TLS certificate
fr: Quelques explication

source: If you installed PaSSHport a year from now, you may encounter this message when you try to connect :
fr: Si vous avez installé PaSSHport il y a 1 an, vous rencontrez peut-être le message suivant lorsque vous essayez de vous connecter :

source: This usually means that passhport (the script) can't connect to passhportd, and the most common cause is that the TLS certificate generated on installation is outdated.
fr: Ceci est généraleument du au fait que passhport (le script) n'arrive pas à se connecter à passhportd, et la cause la plus probable est l'expiration du certificat TLS généré lors de l'installation de PaSSHport.

source: As you can see above, the cert is only generated for a year. It has been created on PaSSHport automated installation.
fr: Comme on peut le voir ci-dessus, le certificat n'est valable que pour 1 an. Ce dernier a été généré lors de l'installation de PaSSHport.

source: Renew certificate with OpenSSL
fr: Renouvellement du certificat avec OpenSSL

source: To renew the certificate, use the openssl command, as follow :
fr: Pour renouveler le certificat, utilisez la commande openssl comme suit :

source: This will generate a self-signed certificate, like the one generated during the installation. It will be valid for 1 year. Change the values to your needs.
fr: Ceci générera un certificat auto-signé, comme celui généré lors de l'installation. Il sera valide pour 1 an. Bien sur, vous pouvez changer ces valeurs selon vos besoins.

source: Restart passhportd
fr: Redémarrer passhportd

source: You now just need to restart passhportd :
fr: Il suffit de redémarrer passhportd :

source: You should now be able to use PaSSHport again.
fr: Vous devriez être désormais en mesure d'utiliser de nouveau PaSSHport.
