Repository: Dreamfire73/passhport
Catalog: docs/po/*/LC_MESSAGES/installation-and-configuration/use-postgresql-*-backend.po
Languages: fr

source: Use PostgreSQL as database backend
fr: Utiliser PostgreSQL comme base de données

source: Install psycopg2 and psycopg2-binary python modules
fr: Installer le module python psycopg2 et psycopg2-binary

source: If you did not use the packaged version of passhport (deb/rpm), proceed as follow. If you used the package version, go directly below, to the `PostgreSQL configuration`_.
fr: Si vous n'avez pas utilisé la version paqueté de PaSSHport (dep/rpm), procédez comme suit. Si vous avez utilisé la version packageé, aller directement à la section `Configuration de PostgreSQL`_.

source: Before installing python libs, be sure to have *pg_config* in your $PATH and some postgres libraries.
fr: Avant d'installer les librairie Python, assurez-vous d'avoir le binaire *pg_config* dans votre variable d'environnemen `$PATH` , ainsi que d'autre outils liés.

source: For Debian, install *postgresql*
fr: Pour Debian, installez *postgresql*

source: For CentOS, install `postgresql` :
fr: Pour CentOS, installez `postgresql` :

source: If you want to use PostgreSQL as the database backend you'll need to add two python modules : psycopg2 and psycopg2-binary.
fr: Si vous voulez utilisez PostgreSQL comme base de données, vous devez installer le module python *psycopg2* et *psycopg2-binary*.

source: As passhport user, install psycopg2 and psycopg2-binary:
fr: En tant qu'utilisateur passhport, on installe *psycopg2* et *psycopg2-binary* :

source: PostgreSQL configuration
fr: Configuration de PostgreSQL

source: Create a passhport user in you postgreSQL server (may be different on your distro, this is just an example) :
fr: On créé un utilisateur passhport dans PostgreSQL (la méthode peut varier selon votre distribution) :

source: Add a password to postgreSQL passhport user :
fr: On ajoute un mot de passe à cet utilisateur :

source: Passhportd configuration
fr: Configuration de passhportd

source: Change the configuration of the *passhportd.ini* file (``/etc/passhport/passhportd.ini``). You need to change the ``SQLALCHEMY_DATABASE_URI`` parameter to :
fr: On modifie le fichier de configuration *passhportd.ini*(``/etc/passhport/passhportd.ini``). On change le paramètre ``SQLALCHEMY_DATABASE_URI`` :

source: As passhport (system) user, initialize the database :
fr: En tant qu'utilisateur passhport (celui du system, pas celui de PostgreSQL), on initialise la base de données :

source: Then you can launch *passhportd* (kill it before if it stills running) :
fr: On lance alors *passhportd* (arrêtez le process s'il tourne) :

source: PaSSHport now use PostgreSQL backend.
fr: PaSSHport utilise maintenant la base de données PostgreSQL.
