Repository: Dreamfire73/passhport
Catalog: docs/po/*/LC_MESSAGES/user-side-usage/generate_key.po
Languages: fr_fr

source: Generate private keys
fr_fr: Générer des clés privées

source: On Windows :
fr_fr: Sur Windows :

source: To generate the public key (extract from the along side generated private key) that you'll give to your PaSSHport admin, use `puttygen` that you can download from `here <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`__ (search for `puttygen.exe`).
fr_fr: Pour générer la clé publique (extraite de la clé privée créée) que vous transmettrez à votre administrateur qui s'occupe de PaSSHport, utilisez `puttygen`, qui vous pouvez télécharger `ici <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`__ (cherchez `puttygen.exe` sur la page).

source: Start puttygen, and on the main windows, select the type of key you want to generate (`1`), the key length (`2`), then click `Generate` button (`3`). Here, we selected RSA and a key length of 4096 (2048 is a considered as a minimum for RSA) :
fr_fr: Démarrez puttygen, et sur la fenêtre principale, sélectionnez le type de clé que vous voulez générer (`1`), la longueur de la clé (`2`), et cliquez ensuite sur le bouton `Generate` (`3`). On a sélectionné dans cette exemple que clé de type RSA avec une taille de 4096 bits (as of 2019, une longueur de 2048 bits est considéré comme un minimum pour une clé RSA) :

source: Move your mouse in the blank space, until the key is generated :
fr_fr: Faites bouger aléatoirement votre curseur dans l'espace blanc, jusqu'à ce que la clé soit générée :

source: Once generated, insert a comment (`1`), a strong passphrase (`2`), then save your private key (`3`).
fr_fr: Une fois générée, mettez un commentaire (`1`), un mot de passe fort (`2`), sauvez ensuite votre clé privée (`3`).

source: You now have to send your RSA public key to your PaSSHport admin. Select your public key as shown in this screen capture, and copy/paste it into a mail to your PaSSHport admin :
fr_fr: Vous devez maintenant envoyez votre clé public RSA à votre administrateur PaSSHport. Sélectionnez votre clé publique comme montré dans cette capture d'écran, et copiez/collez la dans un courriel à destination de votre administrateur PaSSHport :

source: You now have to wait until your PaSSHport admin add your key to your account into PaSSHport.
fr_fr: Vous devez maintenant attendre que votre administrateur PaSSHport ajoute votre clé à votre compte dans PaSSHport.

source: On Linux / Unix :
fr_fr: Sur Linux / Unix :

source: Simply open a terminal, and use the `ssh-keygen` command. Here we generate à 4096bits length RSA key :
fr_fr: Ouvrez simplement un terminal, et utilisez la commande `ssh-keygen`. Ici, non générerons une clé RSA d'une longueur de 4096 bits :

source: Display your newly created public key :
fr_fr: Affichez votre clé nouvellement créée :

source: And send this content to your PaSSHport admin. You now have to wait until your PaSSHport admin add your key to your account into PaSSHport.
fr_fr: Et envoyez le contenu à votre administrateur PaSSHport. Vous devez maintenant attendre que votre administrateur PaSSHport ajoute votre clé à votre compte dans PaSSHport.
